---
kind: method
id: M:Autodesk.Revit.Exceptions.RevitServerCollaborationNotAvailableException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
source: html/a23ef67b-9c6f-53dc-5ab3-b5f36b667c24.htm
---
# Autodesk.Revit.Exceptions.RevitServerCollaborationNotAvailableException.GetObjectData Method

Retrieves data needed to serialize the target object.

## Syntax (C#)
```csharp
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

## Parameters
- **info** (`System.Runtime.Serialization.SerializationInfo`) - Data needed to serialize or deserialize the object.
- **context** (`System.Runtime.Serialization.StreamingContext`) - The destination of the serialized stream.